briancostabile/tiva-bsp/source/bsp/processor/tm4c129/bsp_Gpio_tm4c129.h
/**
 * Copyright 2021 Brian Costabile
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */
/*============================================================================*/
/**
 * @file bsp_Gpio_tm4c129.h
 * @brief Contains the tm4c129 core GPIO defines. Note: Not all of these IOs
 *        may be available
 */
#pragma once

#include "bsp_Types.h"
#include "bsp_Interrupt.h"
#include "inc/hw_memmap.h"
#include "inc/hw_Gpio.h"
#include "driverlib/pin_map.h"

/* Port A */
#define BSP_GPIO_PORT_ID_PA0           0
#define BSP_GPIO_BASE_ADDR_PA0         GPIO_PORTA_BASE
#define BSP_GPIO_BIT_OFFSET_PA0        0
#define BSP_GPIO_BIT_MASK_PA0          (0x00000001 << BSP_GPIO_BIT_OFFSET_PA0)

#define BSP_GPIO_PORT_ID_PA1           0
#define BSP_GPIO_BASE_ADDR_PA1         GPIO_PORTA_BASE
#define BSP_GPIO_BIT_OFFSET_PA1        1
#define BSP_GPIO_BIT_MASK_PA1          (0x00000001 << BSP_GPIO_BIT_OFFSET_PA1)

#define BSP_GPIO_PORT_ID_PA2           0
#define BSP_GPIO_BASE_ADDR_PA2         GPIO_PORTA_BASE
#define BSP_GPIO_BIT_OFFSET_PA2        2
#define BSP_GPIO_BIT_MASK_PA2          (0x00000001 << BSP_GPIO_BIT_OFFSET_PA2)

#define BSP_GPIO_PORT_ID_PA3           0
#define BSP_GPIO_BASE_ADDR_PA3         GPIO_PORTA_BASE
#define BSP_GPIO_BIT_OFFSET_PA3        3
#define BSP_GPIO_BIT_MASK_PA3          (0x00000001 << BSP_GPIO_BIT_OFFSET_PA3)

#define BSP_GPIO_PORT_ID_PA4           0
#define BSP_GPIO_BASE_ADDR_PA4         GPIO_PORTA_BASE
#define BSP_GPIO_BIT_OFFSET_PA4        4
#define BSP_GPIO_BIT_MASK_PA4          (0x00000001 << BSP_GPIO_BIT_OFFSET_TPA4)

#define BSP_GPIO_PORT_ID_PA5           0
#define BSP_GPIO_BASE_ADDR_PA5         GPIO_PORTA_BASE
#define BSP_GPIO_BIT_OFFSET_PA5        5
#define BSP_GPIO_BIT_MASK_PA5          (0x00000001 << BSP_GPIO_BIT_OFFSET_TPA5)

#define BSP_GPIO_PORT_ID_PA6           0
#define BSP_GPIO_BASE_ADDR_PA6         GPIO_PORTA_BASE
#define BSP_GPIO_BIT_OFFSET_PA6        6
#define BSP_GPIO_BIT_MASK_PA6          (0x00000001 << BSP_GPIO_BIT_OFFSET_TPA6)

#define BSP_GPIO_PORT_ID_PA7           0
#define BSP_GPIO_BASE_ADDR_PA7         GPIO_PORTA_BASE
#define BSP_GPIO_BIT_OFFSET_PA7        7
#define BSP_GPIO_BIT_MASK_PA7          (0x00000001 << BSP_GPIO_BIT_OFFSET_TPA7)


/* Port B */
#define BSP_GPIO_PORT_ID_PB0           1
#define BSP_GPIO_BASE_ADDR_PB0         GPIO_PORTB_BASE
#define BSP_GPIO_BIT_OFFSET_PB0        0
#define BSP_GPIO_BIT_MASK_PB0          (0x00000001 << BSP_GPIO_BIT_OFFSET_PB0)

#define BSP_GPIO_PORT_ID_PB1           1
#define BSP_GPIO_BASE_ADDR_PB1         GPIO_PORTB_BASE
#define BSP_GPIO_BIT_OFFSET_PB1        1
#define BSP_GPIO_BIT_MASK_PB1          (0x00000001 << BSP_GPIO_BIT_OFFSET_PB1)

#define BSP_GPIO_PORT_ID_PB2           1
#define BSP_GPIO_BASE_ADDR_PB2         GPIO_PORTB_BASE
#define BSP_GPIO_BIT_OFFSET_PB2        2
#define BSP_GPIO_BIT_MASK_PB2          (0x00000001 << BSP_GPIO_BIT_OFFSET_PB2)

#define BSP_GPIO_PORT_ID_PB3           1
#define BSP_GPIO_BASE_ADDR_PB3         GPIO_PORTB_BASE
#define BSP_GPIO_BIT_OFFSET_PB3        3
#define BSP_GPIO_BIT_MASK_PB3          (0x00000001 << BSP_GPIO_BIT_OFFSET_PB3)

#define BSP_GPIO_PORT_ID_PB4           1
#define BSP_GPIO_BASE_ADDR_PB4         GPIO_PORTB_BASE
#define BSP_GPIO_BIT_OFFSET_PB4        4
#define BSP_GPIO_BIT_MASK_PB4          (0x00000001 << BSP_GPIO_BIT_OFFSET_PB4)

#define BSP_GPIO_PORT_ID_PB5           1
#define BSP_GPIO_BASE_ADDR_PB5         GPIO_PORTB_BASE
#define BSP_GPIO_BIT_OFFSET_PB5        5
#define BSP_GPIO_BIT_MASK_PB5          (0x00000001 << BSP_GPIO_BIT_OFFSET_TPB5)

#define BSP_GPIO_PORT_ID_PB6           1
#define BSP_GPIO_BASE_ADDR_PB6         GPIO_PORTB_BASE
#define BSP_GPIO_BIT_OFFSET_PB6        6
#define BSP_GPIO_BIT_MASK_PB6          (0x00000001 << BSP_GPIO_BIT_OFFSET_PB6)

#define BSP_GPIO_PORT_ID_PB7           1
#define BSP_GPIO_BASE_ADDR_PB7         GPIO_PORTB_BASE
#define BSP_GPIO_BIT_OFFSET_PB7        7
#define BSP_GPIO_BIT_MASK_PB7          (0x00000001 << BSP_GPIO_BIT_OFFSET_PB7)


/* Port C */
#define BSP_GPIO_PORT_ID_PC0           2
#define BSP_GPIO_BASE_ADDR_PC0         GPIO_PORTC_BASE
#define BSP_GPIO_BIT_OFFSET_PC0        0
#define BSP_GPIO_BIT_MASK_PC0          (0x00000001 << BSP_GPIO_BIT_OFFSET_PC0)

#define BSP_GPIO_PORT_ID_PC1           2
#define BSP_GPIO_BASE_ADDR_PC1         GPIO_PORTC_BASE
#define BSP_GPIO_BIT_OFFSET_PC1        1
#define BSP_GPIO_BIT_MASK_PC1          (0x00000001 << BSP_GPIO_BIT_OFFSET_PC1)

#define BSP_GPIO_PORT_ID_PC2           2
#define BSP_GPIO_BASE_ADDR_PC2         GPIO_PORTC_BASE
#define BSP_GPIO_BIT_OFFSET_PC2        2
#define BSP_GPIO_BIT_MASK_PC2          (0x00000001 << BSP_GPIO_BIT_OFFSET_PC2)

#define BSP_GPIO_PORT_ID_PC3           2
#define BSP_GPIO_BASE_ADDR_PC3         GPIO_PORTC_BASE
#define BSP_GPIO_BIT_OFFSET_PC3        3
#define BSP_GPIO_BIT_MASK_PC3          (0x00000001 << BSP_GPIO_BIT_OFFSET_PC3)

#define BSP_GPIO_PORT_ID_PC4           2
#define BSP_GPIO_BASE_ADDR_PC4         GPIO_PORTC_BASE
#define BSP_GPIO_BIT_OFFSET_PC4        4
#define BSP_GPIO_BIT_MASK_PC4          (0x00000001 << BSP_GPIO_BIT_OFFSET_PC4)

