briancostabile/tiva-bsp/source/bsp/processor/tm4c129/bsp_Gpio_tm4c129.h
/* Port G */
#define BSP_GPIO_PORT_ID_PG0           6
#define BSP_GPIO_BASE_ADDR_PG0         GPIO_PORTG_BASE
#define BSP_GPIO_BIT_OFFSET_PG0        0
#define BSP_GPIO_BIT_MASK_PG0          (0x00000001 << BSP_GPIO_BIT_OFFSET_PG0)

#define BSP_GPIO_PORT_ID_PG1           6
#define BSP_GPIO_BASE_ADDR_PG1         GPIO_PORTG_BASE
#define BSP_GPIO_BIT_OFFSET_PG1        1
#define BSP_GPIO_BIT_MASK_PG1          (0x00000001 << BSP_GPIO_BIT_OFFSET_PG1)

#define BSP_GPIO_PORT_ID_PG2           6
#define BSP_GPIO_BASE_ADDR_PG2         GPIO_PORTG_BASE
#define BSP_GPIO_BIT_OFFSET_PG2        2
#define BSP_GPIO_BIT_MASK_PG2          (0x00000001 << BSP_GPIO_BIT_OFFSET_PG2)

#define BSP_GPIO_PORT_ID_PG3           6
#define BSP_GPIO_BASE_ADDR_PG3         GPIO_PORTG_BASE
#define BSP_GPIO_BIT_OFFSET_PG3        3
#define BSP_GPIO_BIT_MASK_PG3          (0x00000001 << BSP_GPIO_BIT_OFFSET_PG3)

#define BSP_GPIO_PORT_ID_PG4           6
#define BSP_GPIO_BASE_ADDR_PG4         GPIO_PORTG_BASE
#define BSP_GPIO_BIT_OFFSET_PG4        4
#define BSP_GPIO_BIT_MASK_PG4          (0x00000001 << BSP_GPIO_BIT_OFFSET_PG4)
#define BSP_GPIO_ALT_FUNC_PG4_U2RX     1

#define BSP_GPIO_PORT_ID_PG5           6
#define BSP_GPIO_BASE_ADDR_PG5         GPIO_PORTG_BASE
#define BSP_GPIO_BIT_OFFSET_PG5        5
#define BSP_GPIO_BIT_MASK_PG5          (0x00000001 << BSP_GPIO_BIT_OFFSET_PG5)
#define BSP_GPIO_ALT_FUNC_PG5_U2TX     1

#define BSP_GPIO_PORT_ID_PG6           6
#define BSP_GPIO_BASE_ADDR_PG6         GPIO_PORTG_BASE
#define BSP_GPIO_BIT_OFFSET_PG6        6
#define BSP_GPIO_BIT_MASK_PG6          (0x00000001 << BSP_GPIO_BIT_OFFSET_PG6)

#define BSP_GPIO_PORT_ID_PG7           6
#define BSP_GPIO_BASE_ADDR_PG7         GPIO_PORTG_BASE
#define BSP_GPIO_BIT_OFFSET_PG7        7
#define BSP_GPIO_BIT_MASK_PG7          (0x00000001 << BSP_GPIO_BIT_OFFSET_PG7)


/* Port H */
#define BSP_GPIO_PORT_ID_PH0           7
#define BSP_GPIO_BASE_ADDR_PH0         GPIO_PORTH_BASE
#define BSP_GPIO_BIT_OFFSET_PH0        0
#define BSP_GPIO_BIT_MASK_PH0          (0x00000001 << BSP_GPIO_BIT_OFFSET_PH0)

#define BSP_GPIO_PORT_ID_PH1           7
#define BSP_GPIO_BASE_ADDR_PH1         GPIO_PORTH_BASE
#define BSP_GPIO_BIT_OFFSET_PH1        1
#define BSP_GPIO_BIT_MASK_PH1          (0x00000001 << BSP_GPIO_BIT_OFFSET_PH1)

#define BSP_GPIO_PORT_ID_PH2           7
#define BSP_GPIO_BASE_ADDR_PH2         GPIO_PORTH_BASE
#define BSP_GPIO_BIT_OFFSET_PH2        2
#define BSP_GPIO_BIT_MASK_PH2          (0x00000001 << BSP_GPIO_BIT_OFFSET_PH2)

#define BSP_GPIO_PORT_ID_PH3           7
#define BSP_GPIO_BASE_ADDR_PH3         GPIO_PORTH_BASE
#define BSP_GPIO_BIT_OFFSET_PH3        3
#define BSP_GPIO_BIT_MASK_PH3          (0x00000001 << BSP_GPIO_BIT_OFFSET_PH3)

#define BSP_GPIO_PORT_ID_PH4           7
#define BSP_GPIO_BASE_ADDR_PH4         GPIO_PORTH_BASE
#define BSP_GPIO_BIT_OFFSET_PH4        4
#define BSP_GPIO_BIT_MASK_PH4          (0x00000001 << BSP_GPIO_BIT_OFFSET_PH4)

#define BSP_GPIO_PORT_ID_PH5           7
#define BSP_GPIO_BASE_ADDR_PH5         GPIO_PORTH_BASE
#define BSP_GPIO_BIT_OFFSET_PH5        5
#define BSP_GPIO_BIT_MASK_PH5          (0x00000001 << BSP_GPIO_BIT_OFFSET_PH5)

#define BSP_GPIO_PORT_ID_PH6           7
#define BSP_GPIO_BASE_ADDR_PH6         GPIO_PORTH_BASE
#define BSP_GPIO_BIT_OFFSET_PH6        6
#define BSP_GPIO_BIT_MASK_PH6          (0x00000001 << BSP_GPIO_BIT_OFFSET_PH6)

#define BSP_GPIO_PORT_ID_PH7           7
#define BSP_GPIO_BASE_ADDR_PH7         GPIO_PORTH_BASE
#define BSP_GPIO_BIT_OFFSET_PH7        7
#define BSP_GPIO_BIT_MASK_PH7          (0x00000001 << BSP_GPIO_BIT_OFFSET_PH7)


/* Port J */
#define BSP_GPIO_PORT_ID_PJ0           8
#define BSP_GPIO_BASE_ADDR_PJ0         GPIO_PORTJ_BASE
#define BSP_GPIO_BIT_OFFSET_PJ0        0
#define BSP_GPIO_BIT_MASK_PJ0          (0x00000001 << BSP_GPIO_BIT_OFFSET_PJ0)

#define BSP_GPIO_PORT_ID_PJ1           8
#define BSP_GPIO_BASE_ADDR_PJ1         GPIO_PORTJ_BASE
#define BSP_GPIO_BIT_OFFSET_PJ1        1
#define BSP_GPIO_BIT_MASK_PJ1          (0x00000001 << BSP_GPIO_BIT_OFFSET_PJ1)

#define BSP_GPIO_PORT_ID_PJ2           8
#define BSP_GPIO_BASE_ADDR_PJ2         GPIO_PORTJ_BASE
#define BSP_GPIO_BIT_OFFSET_PJ2        2
#define BSP_GPIO_BIT_MASK_PJ2          (0x00000001 << BSP_GPIO_BIT_OFFSET_PJ2)

#define BSP_GPIO_PORT_ID_PJ3           8
#define BSP_GPIO_BASE_ADDR_PJ3         GPIO_PORTJ_BASE
#define BSP_GPIO_BIT_OFFSET_PJ3        3
#define BSP_GPIO_BIT_MASK_PJ3          (0x00000001 << BSP_GPIO_BIT_OFFSET_PJ3)

#define BSP_GPIO_PORT_ID_PJ4           8
#define BSP_GPIO_BASE_ADDR_PJ4         GPIO_PORTJ_BASE
#define BSP_GPIO_BIT_OFFSET_PJ4        4
#define BSP_GPIO_BIT_MASK_PJ4          (0x00000001 << BSP_GPIO_BIT_OFFSET_PJ4)

#define BSP_GPIO_PORT_ID_PJ5           8
#define BSP_GPIO_BASE_ADDR_PJ5         GPIO_PORTJ_BASE
#define BSP_GPIO_BIT_OFFSET_PJ5        5
#define BSP_GPIO_BIT_MASK_PJ5          (0x00000001 << BSP_GPIO_BIT_OFFSET_PJ5)

#define BSP_GPIO_PORT_ID_PJ6           8
#define BSP_GPIO_BASE_ADDR_PJ6         GPIO_PORTJ_BASE
#define BSP_GPIO_BIT_OFFSET_PJ6        6
#define BSP_GPIO_BIT_MASK_PJ6          (0x00000001 << BSP_GPIO_BIT_OFFSET_PJ6)

#define BSP_GPIO_PORT_ID_PJ7           8
#define BSP_GPIO_BASE_ADDR_PJ7         GPIO_PORTJ_BASE
#define BSP_GPIO_BIT_OFFSET_PJ7        7
#define BSP_GPIO_BIT_MASK_PJ7          (0x00000001 << BSP_GPIO_BIT_OFFSET_PJ7)


/* Port K */
#define BSP_GPIO_PORT_ID_PK0           9
#define BSP_GPIO_BASE_ADDR_PK0         GPIO_PORTK_BASE
#define BSP_GPIO_BIT_OFFSET_PK0        0
#define BSP_GPIO_BIT_MASK_PK0          (0x00000001 << BSP_GPIO_BIT_OFFSET_PK0)

#define BSP_GPIO_PORT_ID_PK1           9
#define BSP_GPIO_BASE_ADDR_PK1         GPIO_PORTK_BASE
#define BSP_GPIO_BIT_OFFSET_PK1        1
#define BSP_GPIO_BIT_MASK_PK1          (0x00000001 << BSP_GPIO_BIT_OFFSET_PK1)

#define BSP_GPIO_PORT_ID_PK2           9
#define BSP_GPIO_BASE_ADDR_PK2         GPIO_PORTK_BASE
#define BSP_GPIO_BIT_OFFSET_PK2        2
#define BSP_GPIO_BIT_MASK_PK2          (0x00000001 << BSP_GPIO_BIT_OFFSET_PK2)

#define BSP_GPIO_PORT_ID_PK3           9
#define BSP_GPIO_BASE_ADDR_PK3         GPIO_PORTK_BASE
#define BSP_GPIO_BIT_OFFSET_PK3        3
#define BSP_GPIO_BIT_MASK_PK3          (0x00000001 << BSP_GPIO_BIT_OFFSET_PK3)

#define BSP_GPIO_PORT_ID_PK4           9
#define BSP_GPIO_BASE_ADDR_PK4         GPIO_PORTK_BASE
#define BSP_GPIO_BIT_OFFSET_PK4        4
#define BSP_GPIO_BIT_MASK_PK4          (0x00000001 << BSP_GPIO_BIT_OFFSET_PK4)
#define BSP_GPIO_ALT_FUNC_PK4_U7RX     1

#define BSP_GPIO_PORT_ID_PK5           9
#define BSP_GPIO_BASE_ADDR_PK5         GPIO_PORTK_BASE
#define BSP_GPIO_BIT_OFFSET_PK5        5
#define BSP_GPIO_BIT_MASK_PK5          (0x00000001 << BSP_GPIO_BIT_OFFSET_PK5)
#define BSP_GPIO_ALT_FUNC_PK5_U7TX     1

