briancostabile/tiva-bsp/source/bsp/processor/tm4c129/bsp_Gpio_tm4c129.h
#define BSP_GPIO_PORT_ID_PP2           13
#define BSP_GPIO_BASE_ADDR_PP2         GPIO_PORTP_BASE
#define BSP_GPIO_BIT_OFFSET_PP2        2
#define BSP_GPIO_BIT_MASK_PP2          (0x00000001 << BSP_GPIO_BIT_OFFSET_PP2)

#define BSP_GPIO_PORT_ID_PP3           13
#define BSP_GPIO_BASE_ADDR_PP3         GPIO_PORTP_BASE
#define BSP_GPIO_BIT_OFFSET_PP3        3
#define BSP_GPIO_BIT_MASK_PP3          (0x00000001 << BSP_GPIO_BIT_OFFSET_PP3)

#define BSP_GPIO_PORT_ID_PP4           13
#define BSP_GPIO_BASE_ADDR_PP4         GPIO_PORTP_BASE
#define BSP_GPIO_BIT_OFFSET_PP4        4
#define BSP_GPIO_BIT_MASK_PP4          (0x00000001 << BSP_GPIO_BIT_OFFSET_PP4)

#define BSP_GPIO_PORT_ID_PP5           13
#define BSP_GPIO_BASE_ADDR_PP5         GPIO_PORTP_BASE
#define BSP_GPIO_BIT_OFFSET_PP5        5
#define BSP_GPIO_BIT_MASK_PP5          (0x00000001 << BSP_GPIO_BIT_OFFSET_PP5)

#define BSP_GPIO_PORT_ID_PP6           13
#define BSP_GPIO_BASE_ADDR_PP6         GPIO_PORTP_BASE
#define BSP_GPIO_BIT_OFFSET_PP6        6
#define BSP_GPIO_BIT_MASK_PP6          (0x00000001 << BSP_GPIO_BIT_OFFSET_PP6)

#define BSP_GPIO_PORT_ID_PP7           13
#define BSP_GPIO_BASE_ADDR_PP7         GPIO_PORTP_BASE
#define BSP_GPIO_BIT_OFFSET_PP7        7
#define BSP_GPIO_BIT_MASK_PP7          (0x00000001 << BSP_GPIO_BIT_OFFSET_PP7)


/* Port Q */
#define BSP_GPIO_PORT_ID_PQ0           14
#define BSP_GPIO_BASE_ADDR_PQ0         GPIO_PORTQ_BASE
#define BSP_GPIO_BIT_OFFSET_PQ0        0
#define BSP_GPIO_BIT_MASK_PQ0          (0x00000001 << BSP_GPIO_BIT_OFFSET_PQ0)

#define BSP_GPIO_PORT_ID_PQ1           14
#define BSP_GPIO_BASE_ADDR_PQ1         GPIO_PORTQ_BASE
#define BSP_GPIO_BIT_OFFSET_PQ1        1
#define BSP_GPIO_BIT_MASK_PQ1          (0x00000001 << BSP_GPIO_BIT_OFFSET_PQ1)

#define BSP_GPIO_PORT_ID_PQ2           14
#define BSP_GPIO_BASE_ADDR_PQ2         GPIO_PORTQ_BASE
#define BSP_GPIO_BIT_OFFSET_PQ2        2
#define BSP_GPIO_BIT_MASK_PQ2          (0x00000001 << BSP_GPIO_BIT_OFFSET_PQ2)

#define BSP_GPIO_PORT_ID_PQ3           14
#define BSP_GPIO_BASE_ADDR_PQ3         GPIO_PORTQ_BASE
#define BSP_GPIO_BIT_OFFSET_PQ3        3
#define BSP_GPIO_BIT_MASK_PQ3          (0x00000001 << BSP_GPIO_BIT_OFFSET_PQ3)

#define BSP_GPIO_PORT_ID_PQ4           14
#define BSP_GPIO_BASE_ADDR_PQ4         GPIO_PORTQ_BASE
#define BSP_GPIO_BIT_OFFSET_PQ4        4
#define BSP_GPIO_BIT_MASK_PQ4          (0x00000001 << BSP_GPIO_BIT_OFFSET_PQ4)

#define BSP_GPIO_PORT_ID_PQ5           14
#define BSP_GPIO_BASE_ADDR_PQ5         GPIO_PORTQ_BASE
#define BSP_GPIO_BIT_OFFSET_PQ5        5
#define BSP_GPIO_BIT_MASK_PQ5          (0x00000001 << BSP_GPIO_BIT_OFFSET_PQ5)

#define BSP_GPIO_PORT_ID_PQ6           14
#define BSP_GPIO_BASE_ADDR_PQ6         GPIO_PORTQ_BASE
#define BSP_GPIO_BIT_OFFSET_PQ6        6
#define BSP_GPIO_BIT_MASK_PQ6          (0x00000001 << BSP_GPIO_BIT_OFFSET_PQ6)

#define BSP_GPIO_PORT_ID_PQ7           14
#define BSP_GPIO_BASE_ADDR_PQ7         GPIO_PORTQ_BASE
#define BSP_GPIO_BIT_OFFSET_PQ7        7
#define BSP_GPIO_BIT_MASK_PQ7          (0x00000001 << BSP_GPIO_BIT_OFFSET_PQ7)


/* Port R */
#define BSP_GPIO_PORT_ID_PR0           15
#define BSP_GPIO_BASE_ADDR_PR0         GPIO_PORTR_BASE
#define BSP_GPIO_BIT_OFFSET_PR0        0
#define BSP_GPIO_BIT_MASK_PR0          (0x00000001 << BSP_GPIO_BIT_OFFSET_PR0)

#define BSP_GPIO_PORT_ID_PR1           15
#define BSP_GPIO_BASE_ADDR_PR1         GPIO_PORTR_BASE
#define BSP_GPIO_BIT_OFFSET_PR1        1
#define BSP_GPIO_BIT_MASK_PR1          (0x00000001 << BSP_GPIO_BIT_OFFSET_PR1)

#define BSP_GPIO_PORT_ID_PR2           15
#define BSP_GPIO_BASE_ADDR_PR2         GPIO_PORTR_BASE
#define BSP_GPIO_BIT_OFFSET_PR2        2
#define BSP_GPIO_BIT_MASK_PR2          (0x00000001 << BSP_GPIO_BIT_OFFSET_PR2)

#define BSP_GPIO_PORT_ID_PR3           15
#define BSP_GPIO_BASE_ADDR_PR3         GPIO_PORTR_BASE
#define BSP_GPIO_BIT_OFFSET_PR3        3
#define BSP_GPIO_BIT_MASK_PR3          (0x00000001 << BSP_GPIO_BIT_OFFSET_PR3)

#define BSP_GPIO_PORT_ID_PR4           15
#define BSP_GPIO_BASE_ADDR_PR4         GPIO_PORTR_BASE
#define BSP_GPIO_BIT_OFFSET_PR4        4
#define BSP_GPIO_BIT_MASK_PR4          (0x00000001 << BSP_GPIO_BIT_OFFSET_PR4)

#define BSP_GPIO_PORT_ID_PR5           15
#define BSP_GPIO_BASE_ADDR_PR5         GPIO_PORTR_BASE
#define BSP_GPIO_BIT_OFFSET_PR5        5
#define BSP_GPIO_BIT_MASK_PR5          (0x00000001 << BSP_GPIO_BIT_OFFSET_PR5)

#define BSP_GPIO_PORT_ID_PR6           15
#define BSP_GPIO_BASE_ADDR_PR6         GPIO_PORTR_BASE
#define BSP_GPIO_BIT_OFFSET_PR6        6
#define BSP_GPIO_BIT_MASK_PR6          (0x00000001 << BSP_GPIO_BIT_OFFSET_PR6)

#define BSP_GPIO_PORT_ID_PR7           15
#define BSP_GPIO_BASE_ADDR_PR7         GPIO_PORTR_BASE
#define BSP_GPIO_BIT_OFFSET_PR7        7
#define BSP_GPIO_BIT_MASK_PR7          (0x00000001 << BSP_GPIO_BIT_OFFSET_PR7)


/* Port S */
#define BSP_GPIO_PORT_ID_PS0           16
#define BSP_GPIO_BASE_ADDR_PS0         GPIO_PORTS_BASE
#define BSP_GPIO_BIT_OFFSET_PS0        0
#define BSP_GPIO_BIT_MASK_PS0          (0x00000001 << BSP_GPIO_BIT_OFFSET_PS0)

#define BSP_GPIO_PORT_ID_PS1           16
#define BSP_GPIO_BASE_ADDR_PS1         GPIO_PORTS_BASE
#define BSP_GPIO_BIT_OFFSET_PS1        1
#define BSP_GPIO_BIT_MASK_PS1          (0x00000001 << BSP_GPIO_BIT_OFFSET_PS1)

#define BSP_GPIO_PORT_ID_PS2           16
#define BSP_GPIO_BASE_ADDR_PS2         GPIO_PORTS_BASE
#define BSP_GPIO_BIT_OFFSET_PS2        2
#define BSP_GPIO_BIT_MASK_PS2          (0x00000001 << BSP_GPIO_BIT_OFFSET_PS2)

#define BSP_GPIO_PORT_ID_PS3           16
#define BSP_GPIO_BASE_ADDR_PS3         GPIO_PORTS_BASE
#define BSP_GPIO_BIT_OFFSET_PS3        3
#define BSP_GPIO_BIT_MASK_PS3          (0x00000001 << BSP_GPIO_BIT_OFFSET_PS3)

#define BSP_GPIO_PORT_ID_PS4           16
#define BSP_GPIO_BASE_ADDR_PS4         GPIO_PORTS_BASE
#define BSP_GPIO_BIT_OFFSET_PS4        4
#define BSP_GPIO_BIT_MASK_PS4          (0x00000001 << BSP_GPIO_BIT_OFFSET_PS4)

#define BSP_GPIO_PORT_ID_PS5           16
#define BSP_GPIO_BASE_ADDR_PS5         GPIO_PORTS_BASE
#define BSP_GPIO_BIT_OFFSET_PS5        5
#define BSP_GPIO_BIT_MASK_PS5          (0x00000001 << BSP_GPIO_BIT_OFFSET_PS5)

#define BSP_GPIO_PORT_ID_PS6           16
#define BSP_GPIO_BASE_ADDR_PS6         GPIO_PORTS_BASE
#define BSP_GPIO_BIT_OFFSET_PS6        6
#define BSP_GPIO_BIT_MASK_PS6          (0x00000001 << BSP_GPIO_BIT_OFFSET_PS6)

#define BSP_GPIO_PORT_ID_PS7           16
#define BSP_GPIO_BASE_ADDR_PS7         GPIO_PORTS_BASE
#define BSP_GPIO_BIT_OFFSET_PS7        7
#define BSP_GPIO_BIT_MASK_PS7          (0x00000001 << BSP_GPIO_BIT_OFFSET_PS7)


/* Port T */
#define BSP_GPIO_PORT_ID_PT0           17
#define BSP_GPIO_BASE_ADDR_PT0         GPIO_PORTT_BASE
#define BSP_GPIO_BIT_OFFSET_PT0        0
#define BSP_GPIO_BIT_MASK_PT0          (0x00000001 << BSP_GPIO_BIT_OFFSET_PT0)

#define BSP_GPIO_PORT_ID_PT1           17
#define BSP_GPIO_BASE_ADDR_PT1         GPIO_PORTT_BASE
#define BSP_GPIO_BIT_OFFSET_PT1        1
#define BSP_GPIO_BIT_MASK_PT1          (0x00000001 << BSP_GPIO_BIT_OFFSET_PT1)

#define BSP_GPIO_PORT_ID_PT2           17
#define BSP_GPIO_BASE_ADDR_PT2         GPIO_PORTT_BASE
#define BSP_GPIO_BIT_OFFSET_PT2        2
#define BSP_GPIO_BIT_MASK_PT2          (0x00000001 << BSP_GPIO_BIT_OFFSET_PT2)

