briancostabile/tiva-bsp/source/bsp/processor/tm4c129/bsp_Gpio_tm4c129.h
#define BSP_GPIO_PORT_ID_PT3           17
#define BSP_GPIO_BASE_ADDR_PT3         GPIO_PORTT_BASE
#define BSP_GPIO_BIT_OFFSET_PT3        3
#define BSP_GPIO_BIT_MASK_PT3          (0x00000001 << BSP_GPIO_BIT_OFFSET_PT3)

#define BSP_GPIO_PORT_ID_PT4           17
#define BSP_GPIO_BASE_ADDR_PT4         GPIO_PORTT_BASE
#define BSP_GPIO_BIT_OFFSET_PT4        4
#define BSP_GPIO_BIT_MASK_PT4          (0x00000001 << BSP_GPIO_BIT_OFFSET_PT4)

#define BSP_GPIO_PORT_ID_PT5           17
#define BSP_GPIO_BASE_ADDR_PT5         GPIO_PORTT_BASE
#define BSP_GPIO_BIT_OFFSET_PT5        5
#define BSP_GPIO_BIT_MASK_PT5          (0x00000001 << BSP_GPIO_BIT_OFFSET_PT5)

#define BSP_GPIO_PORT_ID_PT6           17
#define BSP_GPIO_BASE_ADDR_PT6         GPIO_PORTT_BASE
#define BSP_GPIO_BIT_OFFSET_PT6        6
#define BSP_GPIO_BIT_MASK_PT6          (0x00000001 << BSP_GPIO_BIT_OFFSET_PT6)

#define BSP_GPIO_PORT_ID_PT7           17
#define BSP_GPIO_BASE_ADDR_PT7         GPIO_PORTT_BASE
#define BSP_GPIO_BIT_OFFSET_PT7        7
#define BSP_GPIO_BIT_MASK_PT7          (0x00000001 << BSP_GPIO_BIT_OFFSET_PT7)



/*============================================================================*/
#define BSP_GPIO_PORT_ID_A 0
#define BSP_GPIO_PORT_ID_B 1
#define BSP_GPIO_PORT_ID_C 2
#define BSP_GPIO_PORT_ID_D 3
#define BSP_GPIO_PORT_ID_E 4
#define BSP_GPIO_PORT_ID_F 5
#define BSP_GPIO_PORT_ID_G 6
#define BSP_GPIO_PORT_ID_H 7
#define BSP_GPIO_PORT_ID_J 8
#define BSP_GPIO_PORT_ID_K 9
#define BSP_GPIO_PORT_ID_L 10
#define BSP_GPIO_PORT_ID_M 11
#define BSP_GPIO_PORT_ID_N 12
#define BSP_GPIO_PORT_ID_P 13
#define BSP_GPIO_PORT_ID_Q 14
#define BSP_GPIO_PORT_ID_R 15
#define BSP_GPIO_PORT_ID_S 16
#define BSP_GPIO_PORT_ID_T 17
typedef uint8_t bsp_Gpio_PortId_t;

/*============================================================================*/
#define BSP_GPIO_PORT_ID_NUM_PORTS 18

/*============================================================================*/
#define BSP_GPIO_PIN_OFFSET_NUM_PINS_PER_PORT 8
typedef uint8_t bsp_Gpio_PinOffset_t;

/*============================================================================*/
typedef void (* bsp_Gpio_InputHandler_t)( bsp_Gpio_PortId_t    portId,
                                          bsp_Gpio_PinOffset_t pinOffset );

/*============================================================================*/
typedef struct {
    uint32_t                 baseAddr;
    uint32_t                 sysCtrlAddr;
    bsp_Interrupt_Id_t       intId;
    bool_t                   bitInterruptable;
    bsp_Gpio_InputHandler_t* handlerTable;
}bsp_Gpio_PlatformPortInfo_t;


/*==============================================================================
 *                            Public Functions
 *============================================================================*/
/*============================================================================*/
void bsp_Gpio_interruptHandlerPortA( void );
void bsp_Gpio_interruptHandlerPortB( void );
void bsp_Gpio_interruptHandlerPortC( void );
void bsp_Gpio_interruptHandlerPortD( void );
void bsp_Gpio_interruptHandlerPortE( void );
void bsp_Gpio_interruptHandlerPortF( void );
void bsp_Gpio_interruptHandlerPortG( void );
void bsp_Gpio_interruptHandlerPortH( void );
void bsp_Gpio_interruptHandlerPortJ( void );
void bsp_Gpio_interruptHandlerPortK( void );
void bsp_Gpio_interruptHandlerPortL( void );
void bsp_Gpio_interruptHandlerPortM( void );
void bsp_Gpio_interruptHandlerPortN( void );
void bsp_Gpio_interruptHandlerPortP0( void );
void bsp_Gpio_interruptHandlerPortP1( void );
void bsp_Gpio_interruptHandlerPortP2( void );
void bsp_Gpio_interruptHandlerPortP3( void );
void bsp_Gpio_interruptHandlerPortP4( void );
void bsp_Gpio_interruptHandlerPortP5( void );
void bsp_Gpio_interruptHandlerPortP6( void );
void bsp_Gpio_interruptHandlerPortP7( void );
void bsp_Gpio_interruptHandlerPortQ0( void );
void bsp_Gpio_interruptHandlerPortQ1( void );
void bsp_Gpio_interruptHandlerPortQ2( void );
void bsp_Gpio_interruptHandlerPortQ3( void );
void bsp_Gpio_interruptHandlerPortQ4( void );
void bsp_Gpio_interruptHandlerPortQ5( void );
void bsp_Gpio_interruptHandlerPortQ6( void );
void bsp_Gpio_interruptHandlerPortQ7( void );
void bsp_Gpio_interruptHandlerPortR( void );
void bsp_Gpio_interruptHandlerPortS( void );
void bsp_Gpio_interruptHandlerPortT( void );


/*==============================================================================
 *                                Globals
 *============================================================================*/
/*============================================================================*/
extern const bsp_Gpio_PlatformPortInfo_t bsp_Gpio_platformPortInfoTable[BSP_GPIO_PORT_ID_NUM_PORTS];
